; domain
(define (domain Depot)
;(:requirements :typing :fluents)
(:types place locatable - object
		depot distributor - place
        truck hoist surface - locatable
        pallet crate - surface)

(:predicates (at ?x - locatable ?y - place) 
             (on ?x - crate ?y - surface)
             (in ?x - crate ?y - truck)
             (lifting ?x - hoist ?y - crate)
             (available ?x - hoist)
             (clear ?x - surface)
)

(:functions 
	(load_limit ?t - truck) 
	(current_load ?t - truck) 
	(weight ?c - crate)
	(fuel-cost)
)
	
(:action Drive
:parameters (?x - truck ?y - place ?z - place) 
:precondition (and (at ?x ?y))
:effect (and (not (at ?x ?y)) (at ?x ?z)
		(increase (fuel-cost) 10)))

(:action Lift
:parameters (?x - hoist ?y - crate ?z - surface ?p - place)
:precondition (and (at ?x ?p) (available ?x) (at ?y ?p) (on ?y ?z) (clear ?y))
:effect (and (not (at ?y ?p)) (lifting ?x ?y) (not (clear ?y)) (not (available ?x)) 
             (clear ?z) (not (on ?y ?z)) (increase (fuel-cost) 1)))

(:action Drop 
:parameters (?x - hoist ?y - crate ?z - surface ?p - place)
:precondition (and (at ?x ?p) (at ?z ?p) (clear ?z) (lifting ?x ?y))
:effect (and (available ?x) (not (lifting ?x ?y)) (at ?y ?p) (not (clear ?z)) (clear ?y)
		(on ?y ?z)))

(:action Load
:parameters (?x - hoist ?y - crate ?z - truck ?p - place)
:precondition (and (at ?x ?p) (at ?z ?p) (lifting ?x ?y)
		(<= (+ (current_load ?z) (weight ?y)) (load_limit ?z)))
:effect (and (not (lifting ?x ?y)) (in ?y ?z) (available ?x)
		(increase (current_load ?z) (weight ?y))))

(:action Unload 
:parameters (?x - hoist ?y - crate ?z - truck ?p - place)
:precondition (and (at ?x ?p) (at ?z ?p) (available ?x) (in ?y ?z))
:effect (and (not (in ?y ?z)) (not (available ?x)) (lifting ?x ?y)
		(decrease (current_load ?z) (weight ?y))))

)

; problem
(define (problem depotprob23) (:domain depot)
(:objects
	depot0 depot1 depot2 - depot
	distributor0 distributor1 distributor2 - distributor
	truck0 truck1 - truck
	pallet0 pallet1 pallet2 pallet3 pallet4 pallet5 pallet6 pallet7 - pallet
	crate0 crate1 crate2 crate3 crate4 crate5 crate6 crate7 crate8 crate9 crate10 crate11 crate12 crate13 - crate
	hoist0 hoist1 hoist2 hoist3 hoist4 hoist5 hoist6 hoist7 hoist8 hoist9 hoist10 hoist11 hoist12 hoist13 hoist14 - hoist)
(:init
	(at pallet0 depot0)
	(clear pallet0)
	(at pallet1 depot1)
	(clear crate2)
	(at pallet2 depot2)
	(clear crate11)
	(at pallet3 distributor0)
	(clear pallet3)
	(at pallet4 distributor1)
	(clear crate13)
	(at pallet5 distributor2)
	(clear crate7)
	(at pallet6 depot0)
	(clear crate10)
	(at pallet7 distributor1)
	(clear crate12)
	(at truck0 depot0)
	(= (current_load truck0) 0)
	(= (load_limit truck0) 380)
	(at truck1 distributor0)
	(= (current_load truck1) 0)
	(= (load_limit truck1) 266)
	(at hoist0 depot0)
	(available hoist0)
	(at hoist1 depot1)
	(available hoist1)
	(at hoist2 depot2)
	(available hoist2)
	(at hoist3 distributor0)
	(available hoist3)
	(at hoist4 distributor1)
	(available hoist4)
	(at hoist5 distributor2)
	(available hoist5)
	(at hoist6 distributor1)
	(available hoist6)
	(at hoist7 depot0)
	(available hoist7)
	(at hoist8 distributor0)
	(available hoist8)
	(at hoist9 distributor0)
	(available hoist9)
	(at hoist10 distributor2)
	(available hoist10)
	(at hoist11 distributor1)
	(available hoist11)
	(at hoist12 depot1)
	(available hoist12)
	(at hoist13 depot2)
	(available hoist13)
	(at hoist14 depot2)
	(available hoist14)
	(at crate0 depot1)
	(on crate0 pallet1)
	(= (weight crate0) 82)
	(at crate1 distributor2)
	(on crate1 pallet5)
	(= (weight crate1) 46)
	(at crate2 depot1)
	(on crate2 crate0)
	(= (weight crate2) 78)
	(at crate3 depot0)
	(on crate3 pallet6)
	(= (weight crate3) 36)
	(at crate4 distributor1)
	(on crate4 pallet7)
	(= (weight crate4) 7)
	(at crate5 distributor2)
	(on crate5 crate1)
	(= (weight crate5) 98)
	(at crate6 distributor1)
	(on crate6 crate4)
	(= (weight crate6) 6)
	(at crate7 distributor2)
	(on crate7 crate5)
	(= (weight crate7) 31)
	(at crate8 distributor1)
	(on crate8 pallet4)
	(= (weight crate8) 92)
	(at crate9 depot2)
	(on crate9 pallet2)
	(= (weight crate9) 48)
	(at crate10 depot0)
	(on crate10 crate3)
	(= (weight crate10) 68)
	(at crate11 depot2)
	(on crate11 crate9)
	(= (weight crate11) 12)
	(at crate12 distributor1)
	(on crate12 crate6)
	(= (weight crate12) 94)
	(at crate13 distributor1)
	(on crate13 crate8)
	(= (weight crate13) 64)
	(= (fuel-cost) 0)
)

(:goal (and
		(on crate0 crate9)
		(on crate2 crate11)
		(on crate4 pallet4)
		(on crate6 pallet7)
		(on crate7 pallet5)
		(on crate8 pallet3)
		(on crate9 crate4)
		(on crate10 pallet6)
		(on crate11 crate7)
		(on crate12 pallet2)
		(on crate13 crate10)
	)
)

(:metric minimize (fuel-cost)))

; plan
1. (lift hoist0 crate10 crate3 depot0)
   deleted: (at crate10 depot0) (clear crate10) (available hoist0) (on crate10 crate3)
   added: (lifting hoist0 crate10) (clear crate3)
   changed: (fuel-cost) from 0 to 1
   goals met: 0 of 11
2. (drive truck0 depot0 depot2)
   deleted: (at truck0 depot0)
   added: (at truck0 depot2)
   changed: (fuel-cost) from 1 to 11
   goals met: 0 of 11
3. (lift hoist4 crate13 crate8 distributor1)
   deleted: (at crate13 distributor1) (clear crate13) (available hoist4) (on crate13 crate8)
   added: (lifting hoist4 crate13) (clear crate8)
   changed: (fuel-cost) from 11 to 12
   goals met: 0 of 11
4. (lift hoist1 crate2 crate0 depot1)
   deleted: (at crate2 depot1) (clear crate2) (available hoist1) (on crate2 crate0)
   added: (lifting hoist1 crate2) (clear crate0)
   changed: (fuel-cost) from 12 to 13
   goals met: 0 of 11
5. (lift hoist12 crate0 pallet1 depot1)
   deleted: (at crate0 depot1) (clear crate0) (available hoist12) (on crate0 pallet1)
   added: (lifting hoist12 crate0) (clear pallet1)
   changed: (fuel-cost) from 13 to 14
   goals met: 0 of 11
6. (drop hoist4 crate13 crate8 distributor1)
   deleted: (lifting hoist4 crate13) (clear crate8)
   added: (available hoist4) (at crate13 distributor1) (clear crate13) (on crate13 crate8)
   goals met: 0 of 11
7. (lift hoist4 crate12 crate6 distributor1)
   deleted: (at crate12 distributor1) (clear crate12) (available hoist4) (on crate12 crate6)
   added: (lifting hoist4 crate12) (clear crate6)
   changed: (fuel-cost) from 14 to 15
   goals met: 0 of 11
8. (drop hoist12 crate0 pallet1 depot1)
   deleted: (lifting hoist12 crate0) (clear pallet1)
   added: (available hoist12) (at crate0 depot1) (clear crate0) (on crate0 pallet1)
   goals met: 0 of 11
9. (lift hoist7 crate3 pallet6 depot0)
   deleted: (at crate3 depot0) (clear crate3) (available hoist7) (on crate3 pallet6)
   added: (lifting hoist7 crate3) (clear pallet6)
   changed: (fuel-cost) from 15 to 16
   goals met: 0 of 11
10. (drop hoist7 crate3 pallet0 depot0)
   deleted: (lifting hoist7 crate3) (clear pallet0)
   added: (available hoist7) (at crate3 depot0) (clear crate3) (on crate3 pallet0)
   goals met: 0 of 11
11. (lift hoist12 crate0 pallet1 depot1)
   deleted: (at crate0 depot1) (clear crate0) (available hoist12) (on crate0 pallet1)
   added: (lifting hoist12 crate0) (clear pallet1)
   changed: (fuel-cost) from 16 to 17
   goals met: 0 of 11
12. (drive truck0 depot2 distributor1)
   deleted: (at truck0 depot2)
   added: (at truck0 distributor1)
   changed: (fuel-cost) from 17 to 27
   goals met: 0 of 11
13. (lift hoist11 crate6 crate4 distributor1)
   deleted: (at crate6 distributor1) (clear crate6) (available hoist11) (on crate6 crate4)
   added: (lifting hoist11 crate6) (clear crate4)
   changed: (fuel-cost) from 27 to 28
   goals met: 0 of 11
14. (load hoist4 crate12 truck0 distributor1)
   deleted: (lifting hoist4 crate12)
   added: (in crate12 truck0) (available hoist4)
   changed: (current_load truck0) from 0 to 94
   goals met: 0 of 11
15. (drive truck1 distributor0 distributor1)
   deleted: (at truck1 distributor0)
   added: (at truck1 distributor1)
   changed: (fuel-cost) from 28 to 38
   goals met: 0 of 11
16. (load hoist11 crate6 truck1 distributor1)
   deleted: (lifting hoist11 crate6)
   added: (in crate6 truck1) (available hoist11)
   changed: (current_load truck1) from 0 to 6
   goals met: 0 of 11
17. (drop hoist12 crate0 pallet1 depot1)
   deleted: (lifting hoist12 crate0) (clear pallet1)
   added: (available hoist12) (at crate0 depot1) (clear crate0) (on crate0 pallet1)
   goals met: 0 of 11
18. (lift hoist13 crate11 crate9 depot2)
   deleted: (at crate11 depot2) (clear crate11) (available hoist13) (on crate11 crate9)
   added: (lifting hoist13 crate11) (clear crate9)
   changed: (fuel-cost) from 38 to 39
   goals met: 0 of 11
19. (drive truck0 distributor1 depot2)
   deleted: (at truck0 distributor1)
   added: (at truck0 depot2)
   changed: (fuel-cost) from 39 to 49
   goals met: 0 of 11
20. (unload hoist2 crate12 truck0 depot2)
   deleted: (in crate12 truck0) (available hoist2)
   added: (lifting hoist2 crate12)
   changed: (current_load truck0) from 94 to 0
   goals met: 0 of 11
21. (lift hoist4 crate13 crate8 distributor1)
   deleted: (at crate13 distributor1) (clear crate13) (available hoist4) (on crate13 crate8)
   added: (lifting hoist4 crate13) (clear crate8)
   changed: (fuel-cost) from 49 to 50
   goals met: 0 of 11
22. (lift hoist12 crate0 pallet1 depot1)
   deleted: (at crate0 depot1) (clear crate0) (available hoist12) (on crate0 pallet1)
   added: (lifting hoist12 crate0) (clear pallet1)
   changed: (fuel-cost) from 50 to 51
   goals met: 0 of 11
23. (lift hoist14 crate9 pallet2 depot2)
   deleted: (at crate9 depot2) (clear crate9) (available hoist14) (on crate9 pallet2)
   added: (lifting hoist14 crate9) (clear pallet2)
   changed: (fuel-cost) from 51 to 52
   goals met: 0 of 11
24. (lift hoist11 crate4 pallet7 distributor1)
   deleted: (at crate4 distributor1) (clear crate4) (available hoist11) (on crate4 pallet7)
   added: (lifting hoist11 crate4) (clear pallet7)
   changed: (fuel-cost) from 52 to 53
   goals met: 0 of 11
25. (drop hoist11 crate4 crate8 distributor1)
   deleted: (lifting hoist11 crate4) (clear crate8)
   added: (available hoist11) (at crate4 distributor1) (clear crate4) (on crate4 crate8)
   goals met: 0 of 11
26. (load hoist14 crate9 truck0 depot2)
   deleted: (lifting hoist14 crate9)
   added: (in crate9 truck0) (available hoist14)
   changed: (current_load truck0) from 0 to 48
   goals met: 0 of 11
27. (lift hoist5 crate7 crate5 distributor2)
   deleted: (at crate7 distributor2) (clear crate7) (available hoist5) (on crate7 crate5)
   added: (lifting hoist5 crate7) (clear crate5)
   changed: (fuel-cost) from 53 to 54
   goals met: 0 of 11
28. (drive truck0 depot2 distributor1)
   deleted: (at truck0 depot2)
   added: (at truck0 distributor1)
   changed: (fuel-cost) from 54 to 64
   goals met: 0 of 11
29. (drop hoist0 crate10 crate3 depot0)
   deleted: (lifting hoist0 crate10) (clear crate3)
   added: (available hoist0) (at crate10 depot0) (clear crate10) (on crate10 crate3)
   goals met: 0 of 11
30. (drive truck1 distributor1 depot2)
   deleted: (at truck1 distributor1)
   added: (at truck1 depot2)
   changed: (fuel-cost) from 64 to 74
   goals met: 0 of 11
31. (load hoist13 crate11 truck1 depot2)
   deleted: (lifting hoist13 crate11)
   added: (in crate11 truck1) (available hoist13)
   changed: (current_load truck1) from 6 to 18
   goals met: 0 of 11
32. (drop hoist2 crate12 pallet2 depot2)
   deleted: (lifting hoist2 crate12) (clear pallet2)
   added: (available hoist2) (at crate12 depot2) (clear crate12) (on crate12 pallet2)
   goals met: 1 of 11
33. (drive truck1 depot2 depot1)
   deleted: (at truck1 depot2)
   added: (at truck1 depot1)
   changed: (fuel-cost) from 74 to 84
   goals met: 1 of 11
34. (lift hoist10 crate5 crate1 distributor2)
   deleted: (at crate5 distributor2) (clear crate5) (available hoist10) (on crate5 crate1)
   added: (lifting hoist10 crate5) (clear crate1)
   changed: (fuel-cost) from 84 to 85
   goals met: 1 of 11
35. (load hoist4 crate13 truck0 distributor1)
   deleted: (lifting hoist4 crate13)
   added: (in crate13 truck0) (available hoist4)
   changed: (current_load truck0) from 48 to 112
   goals met: 1 of 11
36. (drive truck1 depot1 distributor1)
   deleted: (at truck1 depot1)
   added: (at truck1 distributor1)
   changed: (fuel-cost) from 85 to 95
   goals met: 1 of 11
37. (drop hoist12 crate0 pallet1 depot1)
   deleted: (lifting hoist12 crate0) (clear pallet1)
   added: (available hoist12) (at crate0 depot1) (clear crate0) (on crate0 pallet1)
   goals met: 1 of 11
38. (drive truck0 distributor1 depot1)
   deleted: (at truck0 distributor1)
   added: (at truck0 depot1)
   changed: (fuel-cost) from 95 to 105
   goals met: 1 of 11
39. (unload hoist4 crate6 truck1 distributor1)
   deleted: (in crate6 truck1) (available hoist4)
   added: (lifting hoist4 crate6)
   changed: (current_load truck1) from 18 to 12
   goals met: 1 of 11
40. (lift hoist12 crate0 pallet1 depot1)
   deleted: (at crate0 depot1) (clear crate0) (available hoist12) (on crate0 pallet1)
   added: (lifting hoist12 crate0) (clear pallet1)
   changed: (fuel-cost) from 105 to 106
   goals met: 1 of 11
41. (drive truck0 depot1 distributor1)
   deleted: (at truck0 depot1)
   added: (at truck0 distributor1)
   changed: (fuel-cost) from 106 to 116
   goals met: 1 of 11
42. (drive truck1 distributor1 depot1)
   deleted: (at truck1 distributor1)
   added: (at truck1 depot1)
   changed: (fuel-cost) from 116 to 126
   goals met: 1 of 11
43. (load hoist1 crate2 truck1 depot1)
   deleted: (lifting hoist1 crate2)
   added: (in crate2 truck1) (available hoist1)
   changed: (current_load truck1) from 12 to 90
   goals met: 1 of 11
44. (drive truck0 distributor1 depot1)
   deleted: (at truck0 distributor1)
   added: (at truck0 depot1)
   changed: (fuel-cost) from 126 to 136
   goals met: 1 of 11
45. (lift hoist0 crate10 crate3 depot0)
   deleted: (at crate10 depot0) (clear crate10) (available hoist0) (on crate10 crate3)
   added: (lifting hoist0 crate10) (clear crate3)
   changed: (fuel-cost) from 136 to 137
   goals met: 1 of 11
46. (drive truck1 depot1 distributor2)
   deleted: (at truck1 depot1)
   added: (at truck1 distributor2)
   changed: (fuel-cost) from 137 to 147
   goals met: 1 of 11
47. (load hoist5 crate7 truck1 distributor2)
   deleted: (lifting hoist5 crate7)
   added: (in crate7 truck1) (available hoist5)
   changed: (current_load truck1) from 90 to 121
   goals met: 1 of 11
48. (load hoist10 crate5 truck1 distributor2)
   deleted: (lifting hoist10 crate5)
   added: (in crate5 truck1) (available hoist10)
   changed: (current_load truck1) from 121 to 219
   goals met: 1 of 11
49. (lift hoist6 crate4 crate8 distributor1)
   deleted: (at crate4 distributor1) (clear crate4) (available hoist6) (on crate4 crate8)
   added: (lifting hoist6 crate4) (clear crate8)
   changed: (fuel-cost) from 147 to 148
   goals met: 1 of 11
50. (lift hoist11 crate8 pallet4 distributor1)
   deleted: (at crate8 distributor1) (clear crate8) (available hoist11) (on crate8 pallet4)
   added: (lifting hoist11 crate8) (clear pallet4)
   changed: (fuel-cost) from 148 to 149
   goals met: 1 of 11
51. (lift hoist5 crate1 pallet5 distributor2)
   deleted: (at crate1 distributor2) (clear crate1) (available hoist5) (on crate1 pallet5)
   added: (lifting hoist5 crate1) (clear pallet5)
   changed: (fuel-cost) from 149 to 150
   goals met: 1 of 11
52. (drop hoist11 crate8 pallet7 distributor1)
   deleted: (lifting hoist11 crate8) (clear pallet7)
   added: (available hoist11) (at crate8 distributor1) (clear crate8) (on crate8 pallet7)
   goals met: 1 of 11
53. (load hoist5 crate1 truck1 distributor2)
   deleted: (lifting hoist5 crate1)
   added: (in crate1 truck1) (available hoist5)
   changed: (current_load truck1) from 219 to 265
   goals met: 1 of 11
54. (load hoist12 crate0 truck0 depot1)
   deleted: (lifting hoist12 crate0)
   added: (in crate0 truck0) (available hoist12)
   changed: (current_load truck0) from 112 to 194
   goals met: 1 of 11
55. (drive truck0 depot1 distributor1)
   deleted: (at truck0 depot1)
   added: (at truck0 distributor1)
   changed: (fuel-cost) from 150 to 160
   goals met: 1 of 11
56. (drop hoist6 crate4 pallet4 distributor1)
   deleted: (lifting hoist6 crate4) (clear pallet4)
   added: (available hoist6) (at crate4 distributor1) (clear crate4) (on crate4 pallet4)
   goals met: 2 of 11
57. (lift hoist6 crate8 pallet7 distributor1)
   deleted: (at crate8 distributor1) (clear crate8) (available hoist6) (on crate8 pallet7)
   added: (lifting hoist6 crate8) (clear pallet7)
   changed: (fuel-cost) from 160 to 161
   goals met: 2 of 11
58. (drive truck0 distributor1 depot0)
   deleted: (at truck0 distributor1)
   added: (at truck0 depot0)
   changed: (fuel-cost) from 161 to 171
   goals met: 2 of 11
59. (drop hoist6 crate8 crate4 distributor1)
   deleted: (lifting hoist6 crate8) (clear crate4)
   added: (available hoist6) (at crate8 distributor1) (clear crate8) (on crate8 crate4)
   goals met: 2 of 11
60. (unload hoist5 crate7 truck1 distributor2)
   deleted: (in crate7 truck1) (available hoist5)
   added: (lifting hoist5 crate7)
   changed: (current_load truck1) from 265 to 234
   goals met: 2 of 11
61. (load hoist0 crate10 truck0 depot0)
   deleted: (lifting hoist0 crate10)
   added: (in crate10 truck0) (available hoist0)
   changed: (current_load truck0) from 194 to 262
   goals met: 2 of 11
62. (unload hoist7 crate13 truck0 depot0)
   deleted: (in crate13 truck0) (available hoist7)
   added: (lifting hoist7 crate13)
   changed: (current_load truck0) from 262 to 198
   goals met: 2 of 11
63. (drop hoist5 crate7 pallet5 distributor2)
   deleted: (lifting hoist5 crate7) (clear pallet5)
   added: (available hoist5) (at crate7 distributor2) (clear crate7) (on crate7 pallet5)
   goals met: 3 of 11
64. (lift hoist11 crate8 crate4 distributor1)
   deleted: (at crate8 distributor1) (clear crate8) (available hoist11) (on crate8 crate4)
   added: (lifting hoist11 crate8) (clear crate4)
   changed: (fuel-cost) from 171 to 172
   goals met: 3 of 11
65. (unload hoist0 crate10 truck0 depot0)
   deleted: (in crate10 truck0) (available hoist0)
   added: (lifting hoist0 crate10)
   changed: (current_load truck0) from 198 to 130
   goals met: 3 of 11
66. (drive truck0 depot0 distributor0)
   deleted: (at truck0 depot0)
   added: (at truck0 distributor0)
   changed: (fuel-cost) from 172 to 182
   goals met: 3 of 11
67. (unload hoist3 crate0 truck0 distributor0)
   deleted: (in crate0 truck0) (available hoist3)
   added: (lifting hoist3 crate0)
   changed: (current_load truck0) from 130 to 48
   goals met: 3 of 11
68. (drop hoist4 crate6 crate4 distributor1)
   deleted: (lifting hoist4 crate6) (clear crate4)
   added: (available hoist4) (at crate6 distributor1) (clear crate6) (on crate6 crate4)
   goals met: 3 of 11
69. (unload hoist9 crate9 truck0 distributor0)
   deleted: (in crate9 truck0) (available hoist9)
   added: (lifting hoist9 crate9)
   changed: (current_load truck0) from 48 to 0
   goals met: 3 of 11
70. (drop hoist3 crate0 pallet3 distributor0)
   deleted: (lifting hoist3 crate0) (clear pallet3)
   added: (available hoist3) (at crate0 distributor0) (clear crate0) (on crate0 pallet3)
   goals met: 3 of 11
71. (lift hoist8 crate0 pallet3 distributor0)
   deleted: (at crate0 distributor0) (clear crate0) (available hoist8) (on crate0 pallet3)
   added: (lifting hoist8 crate0) (clear pallet3)
   changed: (fuel-cost) from 182 to 183
   goals met: 3 of 11
72. (drop hoist9 crate9 pallet3 distributor0)
   deleted: (lifting hoist9 crate9) (clear pallet3)
   added: (available hoist9) (at crate9 distributor0) (clear crate9) (on crate9 pallet3)
   goals met: 3 of 11
73. (lift hoist3 crate9 pallet3 distributor0)
   deleted: (at crate9 distributor0) (clear crate9) (available hoist3) (on crate9 pallet3)
   added: (lifting hoist3 crate9) (clear pallet3)
   changed: (fuel-cost) from 183 to 184
   goals met: 3 of 11
74. (load hoist3 crate9 truck0 distributor0)
   deleted: (lifting hoist3 crate9)
   added: (in crate9 truck0) (available hoist3)
   changed: (current_load truck0) from 0 to 48
   goals met: 3 of 11
75. (drop hoist0 crate10 pallet6 depot0)
   deleted: (lifting hoist0 crate10) (clear pallet6)
   added: (available hoist0) (at crate10 depot0) (clear crate10) (on crate10 pallet6)
   goals met: 4 of 11
76. (unload hoist5 crate11 truck1 distributor2)
   deleted: (in crate11 truck1) (available hoist5)
   added: (lifting hoist5 crate11)
   changed: (current_load truck1) from 234 to 222
   goals met: 4 of 11
77. (unload hoist10 crate2 truck1 distributor2)
   deleted: (in crate2 truck1) (available hoist10)
   added: (lifting hoist10 crate2)
   changed: (current_load truck1) from 222 to 144
   goals met: 4 of 11
78. (drop hoist8 crate0 pallet3 distributor0)
   deleted: (lifting hoist8 crate0) (clear pallet3)
   added: (available hoist8) (at crate0 distributor0) (clear crate0) (on crate0 pallet3)
   goals met: 4 of 11
79. (lift hoist3 crate0 pallet3 distributor0)
   deleted: (at crate0 distributor0) (clear crate0) (available hoist3) (on crate0 pallet3)
   added: (lifting hoist3 crate0) (clear pallet3)
   changed: (fuel-cost) from 184 to 185
   goals met: 4 of 11
80. (lift hoist6 crate6 crate4 distributor1)
   deleted: (at crate6 distributor1) (clear crate6) (available hoist6) (on crate6 crate4)
   added: (lifting hoist6 crate6) (clear crate4)
   changed: (fuel-cost) from 185 to 186
   goals met: 4 of 11
81. (drop hoist7 crate13 crate10 depot0)
   deleted: (lifting hoist7 crate13) (clear crate10)
   added: (available hoist7) (at crate13 depot0) (clear crate13) (on crate13 crate10)
   goals met: 5 of 11
82. (drive truck0 distributor0 distributor1)
   deleted: (at truck0 distributor0)
   added: (at truck0 distributor1)
   changed: (fuel-cost) from 186 to 196
   goals met: 5 of 11
83. (drive truck1 distributor2 distributor1)
   deleted: (at truck1 distributor2)
   added: (at truck1 distributor1)
   changed: (fuel-cost) from 196 to 206
   goals met: 5 of 11
84. (drop hoist3 crate0 pallet3 distributor0)
   deleted: (lifting hoist3 crate0) (clear pallet3)
   added: (available hoist3) (at crate0 distributor0) (clear crate0) (on crate0 pallet3)
   goals met: 5 of 11
85. (drop hoist5 crate11 crate7 distributor2)
   deleted: (lifting hoist5 crate11) (clear crate7)
   added: (available hoist5) (at crate11 distributor2) (clear crate11) (on crate11 crate7)
   goals met: 6 of 11
86. (drop hoist10 crate2 crate11 distributor2)
   deleted: (lifting hoist10 crate2) (clear crate11)
   added: (available hoist10) (at crate2 distributor2) (clear crate2) (on crate2 crate11)
   goals met: 7 of 11
87. (load hoist11 crate8 truck1 distributor1)
   deleted: (lifting hoist11 crate8)
   added: (in crate8 truck1) (available hoist11)
   changed: (current_load truck1) from 144 to 236
   goals met: 7 of 11
88. (lift hoist9 crate0 pallet3 distributor0)
   deleted: (at crate0 distributor0) (clear crate0) (available hoist9) (on crate0 pallet3)
   added: (lifting hoist9 crate0) (clear pallet3)
   changed: (fuel-cost) from 206 to 207
   goals met: 7 of 11
89. (load hoist6 crate6 truck0 distributor1)
   deleted: (lifting hoist6 crate6)
   added: (in crate6 truck0) (available hoist6)
   changed: (current_load truck0) from 48 to 54
   goals met: 7 of 11
90. (unload hoist11 crate6 truck0 distributor1)
   deleted: (in crate6 truck0) (available hoist11)
   added: (lifting hoist11 crate6)
   changed: (current_load truck0) from 54 to 48
   goals met: 7 of 11
91. (drive truck1 distributor1 distributor0)
   deleted: (at truck1 distributor1)
   added: (at truck1 distributor0)
   changed: (fuel-cost) from 207 to 217
   goals met: 7 of 11
92. (drop hoist11 crate6 pallet7 distributor1)
   deleted: (lifting hoist11 crate6) (clear pallet7)
   added: (available hoist11) (at crate6 distributor1) (clear crate6) (on crate6 pallet7)
   goals met: 8 of 11
93. (unload hoist3 crate8 truck1 distributor0)
   deleted: (in crate8 truck1) (available hoist3)
   added: (lifting hoist3 crate8)
   changed: (current_load truck1) from 236 to 144
   goals met: 8 of 11
94. (load hoist9 crate0 truck1 distributor0)
   deleted: (lifting hoist9 crate0)
   added: (in crate0 truck1) (available hoist9)
   changed: (current_load truck1) from 144 to 226
   goals met: 8 of 11
95. (drive truck1 distributor0 distributor1)
   deleted: (at truck1 distributor0)
   added: (at truck1 distributor1)
   changed: (fuel-cost) from 217 to 227
   goals met: 8 of 11
96. (unload hoist11 crate0 truck1 distributor1)
   deleted: (in crate0 truck1) (available hoist11)
   added: (lifting hoist11 crate0)
   changed: (current_load truck1) from 226 to 144
   goals met: 8 of 11
97. (unload hoist4 crate5 truck1 distributor1)
   deleted: (in crate5 truck1) (available hoist4)
   added: (lifting hoist4 crate5)
   changed: (current_load truck1) from 144 to 46
   goals met: 8 of 11
98. (unload hoist6 crate9 truck0 distributor1)
   deleted: (in crate9 truck0) (available hoist6)
   added: (lifting hoist6 crate9)
   changed: (current_load truck0) from 48 to 0
   goals met: 8 of 11
99. (drop hoist6 crate9 crate4 distributor1)
   deleted: (lifting hoist6 crate9) (clear crate4)
   added: (available hoist6) (at crate9 distributor1) (clear crate9) (on crate9 crate4)
   goals met: 9 of 11
100. (drop hoist11 crate0 crate9 distributor1)
   deleted: (lifting hoist11 crate0) (clear crate9)
   added: (available hoist11) (at crate0 distributor1) (clear crate0) (on crate0 crate9)
   goals met: 10 of 11
101. (drop hoist3 crate8 pallet3 distributor0)
   deleted: (lifting hoist3 crate8) (clear pallet3)
   added: (available hoist3) (at crate8 distributor0) (clear crate8) (on crate8 pallet3)
   goals met: 11 of 11
